* Themes

#+begin_src emacs-lisp :tangle yes
  (add-to-list 'custom-theme-load-path "/home/vb/dev/emacs/themes")
  (load-theme 'gruber-darkest t)
  (set-face-attribute 'default nil :font "Iosevka-6")
  ;; If font is loaded before frame creation it is reset
  (add-to-list 'after-make-frame-functions
               (lambda (frame)
                 (select-frame frame)
                 (set-face-attribute 'default nil :font "Iosevka-6")))
#+end_src

#+RESULTS:
| #[(frame) ((select-frame frame) (set-face-attribute 'default nil :font Iosevka-6)) nil] | pgtk-dnd-init-frame |

Modus operandi customization
#+begin_src emacs-lisp :tangle no
(load-theme 'modus-operandi t)

;; Override colors after the theme is loaded
(with-eval-after-load 'modus-themes
  (modus-themes-with-colors
    (custom-set-faces
     ;; Basic text and background
     `(default ((t (:background "#1c1c1c" :foreground "#e4e4ef")))) ; Dark gray background, light gray text
     `(cursor ((t (:background "#f6f3e8"))))                          ; Light cursor

     ;; Syntax elements
     `(font-lock-comment-face ((t (:foreground "#888888" :slant italic))))
     `(font-lock-string-face ((t (:foreground "#86a2be"))))
     `(font-lock-keyword-face ((t (:foreground "#ffdd33" :weight bold))))
     `(font-lock-function-name-face ((t (:foreground "#96a6c8"))))
     `(font-lock-variable-name-face ((t (:foreground "#ffb964"))))
     `(font-lock-type-face ((t (:foreground "#99cc99"))))
     `(font-lock-constant-face ((t (:foreground "#dca3a3"))))
     `(font-lock-builtin-face ((t (:foreground "#dca3a3"))))
     `(font-lock-warning-face ((t (:foreground "#cc9393" :weight bold))))

     ;; UI elements
     `(region ((t (:background "#333333"))))
     `(mode-line ((t (:background "#444444" :foreground "#dddddd"))))
     `(mode-line-inactive ((t (:background "#2a2a2a" :foreground "#888888"))))
     `(fringe ((t (:background "#1c1c1c"))))
     `(minibuffer-prompt ((t (:foreground "#96a6c8" :weight bold))))
     )))
#+end_src


Show whitespaces in program mode
#+begin_src emacs-lisp :tangle yes
  (require 'whitespace)
  (setq whitespace-style '(face empty newline trailing space-mark indentation::space))
  ;; (add-hook 'prog-mode-hook 'whitespace-mode)
#+end_src

#+RESULTS:
| face | empty | newline | trailing | space-mark | indentation::space |

* Ledger

Specify useful commands for ledger
#+begin_src emacs-lisp :tangle yes
  (setq ledger-reports
      '(("cashflow" "ledger -f %(ledger-file) --cost -X EUR bal ^Income ^Expenses")
        ("cashflow-rsd" "ledger -f %(ledger-file) --cost -X RSD bal ^Income ^Expenses")
        ("net-worth" "ledger -f %(ledger-file) --cost -X EUR bal ^Assets ^Liabilities")
        ("net-worth-rsd" "ledger -f %(ledger-file) --cost -X RSD bal ^Assets ^Liabilities")
        ("prices" "ledger prices -f %(ledger-file)")
        ("bal" "%(binary) -f %(ledger-file) --cost -X EUR bal")
        ("bal-rsd" "%(binary) -f %(ledger-file) --cost -X RSD bal")
        ("reg" "%(binary) -f %(ledger-file) --cost -X EUR reg")
        ("reg-rsd" "%(binary) -f %(ledger-file) --cost -X RSD reg")
        ("payee" "%(binary) -f %(ledger-file) --cost -X EUR reg @%(payee)")
        ("payee-rsd" "%(binary) -f %(ledger-file) --cost -X RSD reg @%(payee)")
        ("account" "%(binary) -f %(ledger-file) --cost -X EUR reg %(account)")
        ("account-rsd" "%(binary) -f %(ledger-file) --cost -X RSD reg %(account)")))
#+end_src

#+RESULTS:
| cashflow      | ledger -f %(ledger-file) --cost -X EUR bal ^Income ^Expenses    |
| cashflow-rsd  | ledger -f %(ledger-file) --cost -X RSD bal ^Income ^Expenses    |
| net-worth     | ledger -f %(ledger-file) --cost -X EUR bal ^Assets ^Liabilities |
| net-worth-rsd | ledger -f %(ledger-file) --cost -X RSD bal ^Assets ^Liabilities |
| prices        | ledger prices -f %(ledger-file)                                 |
| bal           | %(binary) -f %(ledger-file) --cost -X EUR bal                   |
| bal-rsd       | %(binary) -f %(ledger-file) --cost -X RSD bal                   |
| reg           | %(binary) -f %(ledger-file) --cost -X EUR reg                   |
| reg-rsd       | %(binary) -f %(ledger-file) --cost -X RSD reg                   |
| payee         | %(binary) -f %(ledger-file) --cost -X EUR reg @%(payee)         |
| payee-rsd     | %(binary) -f %(ledger-file) --cost -X RSD reg @%(payee)         |
| account       | %(binary) -f %(ledger-file) --cost -X EUR reg %(account)        |
| account-rsd   | %(binary) -f %(ledger-file) --cost -X RSD reg %(account)        |

** Compilation mode

Skip warnings in compilation mode.
#+begin_src emacs-lisp :tangle no
  (setq compilation-skip-threshold 2)
#+end_src

#+RESULTS:
: 2

